## Importaciones necesarias

In [1]:
import pandas as pd 
import numpy as np

---

## Lectura de .csv

In [2]:
df1 = pd.read_csv("data/calendar.csv")

df1.head(2)

,listing_id,date,available,price,adjusted_price,minimum_nights,maximum_nights
0,336834,2019-09-19,f,$63.00,$63.00,5,250
1,6369,2019-09-19,f,$70.00,$70.00,1,365

---

### Cantidad de filas y columnas df1:

In [6]:
print(f"Hay {df1.shape[0]} filas y {df1.shape[1]} de columnas.")

Hay 7605505 filas y 7 de columnas.

---

### Tipo de columnas df1:

In [8]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7605505 entries, 0 to 7605504
Data columns (total 7 columns):
 #   Column          Dtype
---  ------          -----
 0   listing_id      int64
 1   date            object
 2   available       object
 3   price           object
 4   adjusted_price  object
 5   minimum_nights  int64
 6   maximum_nights  int64
dtypes: int64(3), object(4)
memory usage: 406.2+ MB

---

In [3]:
df2 = pd.read_csv("data/listings.csv")

df2.head(2)

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,6369,"Rooftop terrace room with ensuite bathroom, Airc.",13660,Simon,Chamartín,Hispanoamérica,40.45628,-3.67763,Private room,70,1,65,2019-09-04,0.56,1,53
1,21853,Bright and airy room,83531,Abdel,Latina,Cármenes,40.40341,-3.74084,Private room,17,4,33,2018-07-15,0.55,2,48

In [4]:
df3 = pd.read_csv("data/neighbourhoods.csv")

df3.head(2)

  neighbourhood_group neighbourhood
0          Arganzuela       Acacias
1          Arganzuela        Atocha

In [5]:
df4 = pd.read_csv("data/reviews_detailed.csv")

df4.head(2)

,listing_id,id,date,reviewer_id,reviewer_name,comments
0,6369,29428,2010-03-14,84790,Nancy,Simon and Arturo have the ultimate location in...
1,6369,31018,2010-03-23,84338,David,Myself and Kristy originally planned on stayin...

---